import CityList from "./components/CityList";
import "./styles.css";
const City = [
  {
    name: "Дніпро",
    text:
      "Дніпро - діловий, промисловий та наукове місто України. Розвинена металургійна, машинобудівна та гірничорудна промисловість. В місті розвинена освіта, культура та мистецтво. Місцем для прогулянки є набережна .Її довжина складає майже 23 км. На Жовтневій площі та в парку ім.Шевченка знаходяться історична архітектура Дніпра.",
    img: "https://aws-travel-guide.s3.eu-west-1.amazonaws.com/default_image_size/6346f105130b9_%D0%94%D0%BD%D1%96%D0%BF%D1%80%D0%BE.jpg"
  },
  {
    name: "Івано-Франківськ",
    text:
      "Івано-Франківськ – це місто з багатовіковою історією, давніми традиціями, неординарним мистецьким життям та динамічною економікою. Обласний центр розташувався на перетині двох Бистриць, а саме: Бистриці Надвірнянської та Бистриці Солотвинської. Вдале географічне розташування наближує Івано-Франківськ не тільки до держав-членів ЄС, але й створює сприятливі умови для багатостороннього розвитку.",
    img:
      "https://ukr-prokat.com/wp-content/uploads/2020/08/ivano-frankivsk.jpg"
  },
  {
    name: "Одеса",
    text:
      "Одеса — не лише одне з популярних міст для літнього відпочинку, але й дійсно морська перлина України. Тут панує привітна атмосфера, у розпал туристичного сезону завжди спекотно і сонячно. На гостей міста чекають не лише смачні страви з місцевих делікатесів, але й розкішні краєвиди, незабутній шум моря та пісчані пляжі.",
    img: "https://aws-travel-guide.s3.eu-west-1.amazonaws.com/default_image_size/61aba3f687b41_%D0%BE%D0%B4%D0%B5%D1%81%D0%B0.jpg"
  },
  {
    name: "Запоріжжя",
    text:
      "Запоріжжя — місто, де не лише мимоволі поринаєш у XVI-XVII ст., стаючи частиною Запорізької Січі, а й маєш можливість дізнатись про цікаві історичні місця та помилуватись гарними краєвидами. У Запоріжжі знаходиться одне з семи чудес України — національний заповідник Хортиця, яка дозволить на власні очі побачити, яким був побут козаків, чим вони займались та в яких умовах проживали. ",
    img:
      "https://aws-travel-guide.s3.eu-west-1.amazonaws.com/default_image_size/61aba3f673d5a_%D0%B7%D0%B0%D0%BF%D0%BE%D1%80%D0%BE%D0%B6%D1%8C%D0%B5.jpg"
  }
];
export default function App() {
  return (
    <div className="App">
      <h1>Міста України: </h1>
      <CityList City={City} />
    </div>
  );
}